[
  {
    "_id": "ee7f0234-775c-471f-8dbc-afc89f49631b",
    "title": "Tech Innovation Meetup",
    "description": "Join us for an exciting evening where tech enthusiasts, innovators, and industry leaders come together to explore the latest advancements in artificial intelligence, blockchain, and sustainable technologies. This meetup features keynote speeches from prominent figures in the field, interactive workshops on coding challenges, and ample networking opportunities to connect with like-minded professionals. Whether you're a startup founder, developer, or simply curious about the future of tech, this event promises inspiring discussions and potential collaborations that could shape tomorrow's innovations.",
    "date": "2025-11-06T00:00:00",
    "time": "18:15",
    "location": "Charity Hall, Oakville",
    "category": "Other",
    "userID": "7b253546-b6dd-4a60-817e-a23673b9f98b",
    "status": "Published",
    "price": 57.2362183539319,
    "createdAt": "2025-10-12T00:00:00",
    "updatedAt": "2025-11-03T00:00:00"
  },
  {
    "_id": "d5438fb2-0640-45cf-892d-7769d9197e52",
    "title": "Debate Club Meeting",
    "description": "Engage in lively and intellectual debates on contemporary issues ranging from climate change policies to ethical dilemmas in AI. Our club fosters critical thinking, respectful discourse, and diverse perspectives in a supportive environment. This session will feature prepared topics with audience participation, moderated discussions, and post-debate reflections. Perfect for students, professionals, and anyone passionate about honing their argumentative skills while building community connections through shared ideas.",
    "date": "2025-11-05T00:00:00",
    "time": "18:0",
    "location": "Local Park, Mississauga",
    "category": "Fair",
    "userID": "8d1aadc2-9094-4411-90a7-160e4b5ffe28",
    "status": "Pending Approval",
    "price": 99.80002461732596,
    "createdAt": "2025-10-02T00:00:00",
    "updatedAt": "2025-10-31T00:00:00"
  },
  {
    "_id": "5b656107-973e-4ed8-8708-fb132f9fde8b",
    "title": "Startup Pitch Session",
    "description": "Aspiring entrepreneurs and venture capitalists unite for a high-energy pitch competition where innovative ideas take center stage. Presenters will showcase their business models, market strategies, and growth plans in short, compelling pitches followed by Q&A sessions and feedback from seasoned investors. Attendees can learn from real-world pitching techniques, network with potential mentors and partners, and even submit their own ideas for future events. This is your gateway to turning concepts into viable startups.",
    "date": "2025-12-02T00:00:00",
    "time": "09:45",
    "location": "Downtown Community Center, Brampton",
    "category": "Market",
    "userID": "e1236a58-acdb-4e79-b2a6-367b4ceabcf0",
    "status": "Pending Approval",
    "price": 39.8604029013522,
    "createdAt": "2025-09-30T00:00:00",
    "updatedAt": "2025-11-04T00:00:00"
  },
  {
    "_id": "098da219-5f80-4829-b19b-1c9f1d6bceb1",
    "title": "Environmental Film Screening",
    "description": "Immerse yourself in powerful documentaries that highlight global environmental challenges and triumphant conservation stories. This screening series includes panel discussions with ecologists, filmmakers, and activists, encouraging viewers to reflect on personal and collective actions for sustainability. Bring your questions and join the conversation on topics like ocean plastic pollution and urban greening initiatives. A great opportunity to educate, inspire, and mobilize for a greener future.",
    "date": "2026-01-23T00:00:00",
    "time": "17:30",
    "location": "Local Park, Mississauga",
    "category": "Market",
    "userID": "c0b42412-190b-4723-8211-5610e0161251",
    "status": "Pending Approval",
    "price": 66.85123079698228,
    "createdAt": "2025-10-23T00:00:00",
    "updatedAt": "2025-11-01T00:00:00"
  },
  {
    "_id": "8f4b58c3-b718-4fd4-a01b-cd1a4ce70289",
    "title": "Yoga and Meditation Retreat",
    "description": "Escape the hustle of daily life for a transformative day of yoga flows, guided meditations, and mindfulness practices led by certified instructors. Sessions cater to all levels, from beginners exploring breathwork to advanced practitioners diving into restorative poses. Enjoy nourishing plant-based meals, serene outdoor settings, and optional one-on-one consultations. This retreat is designed to reduce stress, enhance well-being, and foster a deeper connection with yourself and nature.",
    "date": "2025-10-31T00:00:00",
    "time": "15:30",
    "location": "Charity Hall, Oakville",
    "category": "Market",
    "userID": "8d1aadc2-9094-4411-90a7-160e4b5ffe28",
    "status": "Published",
    "price": 55.88449823771822,
    "createdAt": "2025-10-27T00:00:00",
    "updatedAt": "2025-11-04T00:00:00"
  },
  {
    "_id": "a58f7fdc-032c-47fa-9081-f5d174f27ae2",
    "title": "Art and Craft Fair",
    "description": "Celebrate creativity at this vibrant fair showcasing local artisans, handmade jewelry, pottery, paintings, and unique upcycled decor. Browse stalls filled with one-of-a-kind items, watch live demonstrations of weaving and sculpture, and participate in free craft workshops for all ages. Live music, food trucks offering ethnic cuisines, and a kids' zone with face painting add to the festive atmosphere. Support small businesses and find perfect gifts while enjoying a day of artistic inspiration.",
    "date": "2025-10-31T00:00:00",
    "time": "17:30",
    "location": "Tech Hub Toronto",
    "category": "Workshop",
    "userID": "7aa8a6b2-35f4-488b-81f1-49cdbd2a13bf",
    "status": "Published",
    "price": 0.15841312910694905,
    "createdAt": "2025-10-04T00:00:00",
    "updatedAt": "2025-10-31T00:00:00"
  },
  {
    "_id": "739442b6-9d4d-4879-bf35-574b9ee114bd",
    "title": "Local Farmers Market",
    "description": "Savor the freshest produce, artisanal cheeses, and organic honey from regional farmers at this bustling weekly market. Vendors offer live cooking demos, flower arrangements, and eco-friendly soaps, while buskers provide musical entertainment. Learn about sustainable farming practices through farmer Q&As and support local economies by purchasing directly from growers. Family-oriented with pet-friendly policies, it's a delightful way to stock up on wholesome goods and enjoy community vibes.",
    "date": "2025-12-05T00:00:00",
    "time": "14:15",
    "location": "Downtown Community Center, Brampton",
    "category": "Market",
    "userID": "05bd335f-27d4-4c2a-8b43-f54ee5f2f839",
    "status": "Rejected",
    "price": 93.05269142684408,
    "createdAt": "2025-10-02T00:00:00",
    "updatedAt": "2025-11-02T00:00:00"
  },
  {
    "_id": "b9e1b59e-697c-44ca-b997-b1835705ab18",
    "title": "Poetry Reading Night",
    "description": "Unleash your inner poet in an intimate setting where voices echo verses on love, loss, resilience, and joy. Featured readers include emerging talents and seasoned slam poets, with open mic slots for attendees to share their work. Accompanied by soft acoustic guitar and candlelit ambiance, this night celebrates the power of words to heal and connect. Beginners welcome—bring a poem or simply listen and be moved by raw, heartfelt expressions.",
    "date": "2025-12-02T00:00:00",
    "time": "18:15",
    "location": "Downtown Community Center, Brampton",
    "category": "Social",
    "userID": "64c63ebb-dbc0-4a42-8653-f7ad2ea78d6b",
    "status": "Rejected",
    "price": 43.85847342400125,
    "createdAt": "2025-10-18T00:00:00",
    "updatedAt": "2025-11-02T00:00:00"
  },
  {
    "_id": "fa3587b8-1ef9-48ad-9302-295b802b5bf0",
    "title": "Board Games Night",
    "description": "Rediscover the joy of analog fun with a massive collection of board games, from strategy epics like Settlers of Catan to quick-hit party games like Codenames. Guided by experienced hosts, groups form based on skill and interest, ensuring balanced play. Snacks and beverages provided, with themes rotating monthly—next up: mystery and adventure. A social hub for gamers to unwind, laugh, and forge friendships over dice rolls and clever moves.",
    "date": "2025-11-13T00:00:00",
    "time": "18:15",
    "location": "Tech Hub Toronto",
    "category": "Volunteer",
    "userID": "f4d970af-8511-48cc-bc09-6e894722c7df",
    "status": "Published",
    "price": 51.45950948896968,
    "createdAt": "2025-10-10T00:00:00",
    "updatedAt": "2025-11-03T00:00:00"
  },
  {
    "_id": "bcf946a4-ff19-4766-bbee-1b7ceada5234",
    "title": "Charity Bake Sale",
    "description": "Indulge in decadent treats while supporting a noble cause—proceeds fund local food banks and youth programs. Sample gluten-free brownies, vegan cupcakes, and savory scones from community bakers, with tasting stations and recipe swaps. Live baking contests, photo booths with fun props, and a raffle for gift baskets enhance the festivities. A sweet way to give back, connect with neighbors, and satisfy your sweet tooth for a greater good.",
    "date": "2025-11-18T00:00:00",
    "time": "13:45",
    "location": "Local Park, Mississauga",
    "category": "Volunteer",
    "userID": "8d1aadc2-9094-4411-90a7-160e4b5ffe28",
    "status": "Pending Approval",
    "price": 66.9293473419821,
    "createdAt": "2025-10-10T00:00:00",
    "updatedAt": "2025-11-02T00:00:00"
  },
  {
    "_id": "17b1c1a9-ff39-4eee-960f-77b18a3a6e19",
    "title": "Community Cleanup Drive",
    "description": "Roll up your sleeves for a hands-on effort to revitalize our neighborhood parks and streets, removing litter, planting flowers, and restoring natural habitats. Equipped with gloves, bags, and tools, teams will tackle assigned zones while learning about waste reduction from environmental volunteers. Followed by a picnic with local music and awards for top collectors, this drive builds pride, teamwork, and lasting environmental stewardship in our community.",
    "date": "2026-01-22T00:00:00",
    "time": "18:30",
    "location": "Local Park, Mississauga",
    "category": "Fair",
    "userID": "e1236a58-acdb-4e79-b2a6-367b4ceabcf0",
    "status": "Rejected",
    "price": 71.83523182407774,
    "createdAt": "2025-09-30T00:00:00",
    "updatedAt": "2025-11-03T00:00:00"
  },
  {
    "_id": "28f3132f-bcbe-454b-b680-57ff7b8e2b89",
    "title": "Social Networking Night",
    "description": "Break the ice and build meaningful relationships at this casual mixer tailored for young professionals and newcomers. Speed-networking rounds, themed icebreakers like 'two truths and a lie,' and facilitated small-group chats on career goals and hobbies. Guest speakers share tips on effective networking, with business card exchanges and follow-up email prompts. A low-pressure space to expand your circle and uncover hidden opportunities.",
    "date": "2026-01-24T00:00:00",
    "time": "18:15",
    "location": "Local Park, Mississauga",
    "category": "Charity",
    "userID": "05bd335f-27d4-4c2a-8b43-f54ee5f2f839",
    "status": "Published",
    "price": 2.546640175241466,
    "createdAt": "2025-10-28T00:00:00",
    "updatedAt": "2025-10-30T00:00:00"
  },
  {
    "_id": "69642d3c-80b0-4d15-b7ad-b49464468143",
    "title": "Career Fair for Students",
    "description": "Unlock your future at this dynamic fair connecting high school and college students with employers in tech, healthcare, and creative industries. Booths offer resume reviews, mock interviews, and skill-building workshops on LinkedIn optimization and elevator pitches. Panel discussions with alumni success stories and internship spotlights provide insider insights. Free swag, photo ops, and on-site applications make it an essential launchpad for ambitious young talents.",
    "date": "2026-01-08T00:00:00",
    "time": "10:30",
    "location": "Local Park, Mississauga",
    "category": "Other",
    "userID": "7aa8a6b2-35f4-488b-81f1-49cdbd2a13bf",
    "status": "Rejected",
    "price": 64.92287897296248,
    "createdAt": "2025-10-02T00:00:00",
    "updatedAt": "2025-10-31T00:00:00"
  },
  {
    "_id": "5b6b1530-4c3c-4c05-b109-46c10c5cd6b1",
    "title": "Holiday Gift Exchange",
    "description": "Spread cheer and build bonds through a whimsical white elephant gift swap, where wrapped surprises (budget $20) lead to hilarious steals and trades. Themed categories like 'cozy comforts' or 'gadget gadgets' add flair, with holiday tunes, mulled cider, and a photo booth capturing the laughter. Secret Santa reveals and charitable donations for unmatched gifts ensure everyone leaves with joy and a sense of giving.",
    "date": "2025-12-03T00:00:00",
    "time": "12:15",
    "location": "Virtual via Zoom",
    "category": "Fair",
    "userID": "64c63ebb-dbc0-4a42-8653-f7ad2ea78d6b",
    "status": "Rejected",
    "price": 51.551495239335765,
    "createdAt": "2025-10-01T00:00:00",
    "updatedAt": "2025-11-03T00:00:00"
  },
  {
    "_id": "5f2e7ba3-1f69-4dd3-9fc0-63449c96aaf1",
    "title": "Culinary Cooking Class",
    "description": "Master the art of fusion cuisine in this hands-on class blending Italian and Asian flavors, from handmade ravioli stuffed with shiitake to miso-infused tiramisu. Led by a chef with Michelin experience, you'll chop, stir, and plate under expert guidance, with wine pairings and tasting notes. Take home recipes, a certificate, and new skills to impress at your next dinner party. Suitable for novices and foodies alike.",
    "date": "2026-01-26T00:00:00",
    "time": "18:30",
    "location": "Virtual via Zoom",
    "category": "Fair",
    "userID": "dcba6042-11a9-49c4-b122-f529f5d1cf53",
    "status": "Rejected",
    "price": 26.751201895894027,
    "createdAt": "2025-10-02T00:00:00",
    "updatedAt": "2025-11-02T00:00:00"
  },
  {
    "_id": "545fcd47-bad8-4828-81bf-806587912237",
    "title": "Music Jam Session",
    "description": "Plug in and play with fellow musicians in an unscripted jam exploring jazz fusion, rock anthems, and original compositions. No auditions—bring your guitar, keys, or voice for collaborative improv sessions guided by a pro bandleader. Recording booth available for capturing magic moments, plus open critique circles to elevate your craft. A rhythmic haven for novices to pros seeking spontaneous creativity and musical camaraderie.",
    "date": "2025-11-30T00:00:00",
    "time": "16:0",
    "location": "Downtown Community Center, Brampton",
    "category": "Other",
    "userID": "dcba6042-11a9-49c4-b122-f529f5d1cf53",
    "status": "Rejected",
    "price": 75.05826427458749,
    "createdAt": "2025-10-05T00:00:00",
    "updatedAt": "2025-10-30T00:00:00"
  },
  {
    "_id": "4a400e6d-a8d7-46be-a98d-a97a30f3cf30",
    "title": "Eco-Friendly Workshop",
    "description": "Empower your home with DIY sustainability through workshops on composting systems, upcycled furniture, and zero-waste kitchen hacks. Expert facilitators provide materials and step-by-step guidance, with group challenges to innovate solutions. Share successes, troubleshoot common pitfalls, and leave with a personalized action plan plus resources for ongoing eco-living. A practical step toward reducing your footprint, one craft at a time.",
    "date": "2026-01-11T00:00:00",
    "time": "11:30",
    "location": "Virtual via Zoom",
    "category": "Market",
    "userID": "d275ada0-bf2d-46a1-a435-8d952dea4307",
    "status": "Published",
    "price": 99.29780192056376,
    "createdAt": "2025-10-14T00:00:00",
    "updatedAt": "2025-11-02T00:00:00"
  },
  {
    "_id": "f3f622c2-8259-48bb-a062-7018f5f9e5e3",
    "title": "Mental Health Support Group",
    "description": "Find solace and strength in a confidential circle where facilitators trained in trauma-informed care guide conversations on anxiety management, grief processing, and self-compassion practices. Peer sharing, mindfulness exercises, and resource referrals create a safe harbor for vulnerability. Themed nights like 'boundaries in relationships' offer targeted support. Join to feel seen, supported, and equipped with tools for emotional resilience.",
    "date": "2025-11-05T00:00:00",
    "time": "15:30",
    "location": "Virtual via Zoom",
    "category": "Fair",
    "userID": "05bd335f-27d4-4c2a-8b43-f54ee5f2f839",
    "status": "Pending Approval",
    "price": 65.3199687893363,
    "createdAt": "2025-10-15T00:00:00",
    "updatedAt": "2025-10-31T00:00:00"
  },
  {
    "_id": "85715c8e-7d76-4f0a-8931-f64bef9b916a",
    "title": "Health Awareness Seminar",
    "description": "Empower your wellness journey with evidence-based insights on nutrition, exercise, and mental health from certified nutritionists and trainers. Interactive segments include BMI assessments, meal planning demos, and stress-relief techniques like progressive muscle relaxation. Q&A with doctors addresses common concerns, and free health screenings provide personalized feedback. Walk away with actionable plans to thrive holistically.",
    "date": "2025-11-04T00:00:00",
    "time": "16:45",
    "location": "Virtual via Zoom",
    "category": "Tech",
    "userID": "8d1aadc2-9094-4411-90a7-160e4b5ffe28",
    "status": "Published",
    "price": 7.368279572890646,
    "createdAt": "2025-10-22T00:00:00",
    "updatedAt": "2025-11-01T00:00:00"
  },
  {
    "_id": "1a2b3c4d-5e6f-7g8h-9i0j-k1l2m3n4o5p6",
    "title": "Book Club Discussion",
    "description": "Delve into the pages of 'The Midnight Library' by Matt Haig, exploring themes of regret, choice, and alternate lives in a thought-provoking group setting. Facilitated by a literature enthusiast, the discussion will cover character arcs, philosophical undertones, and personal reflections. Bring your annotated copy, favorite quotes, and snacks to share. This session aims to spark empathy, introspection, and lasting bookish friendships among avid readers.",
    "date": "2025-12-10T00:00:00",
    "time": "19:00",
    "location": "Virtual via Zoom",
    "category": "Social",
    "userID": "q7r8s9t0-u1v2-w3x4-y5z6-a7b8c9d0e1f2",
    "status": "Published",
    "price": 0,
    "createdAt": "2025-10-15T00:00:00",
    "updatedAt": "2025-11-05T00:00:00"
  },
  {
    "_id": "2b3c4d5e-6f7g-8h9i-0j1k-l2m3n4o5p6q7",
    "title": "Gardening Workshop",
    "description": "Transform your green thumb aspirations into reality with this beginner-friendly workshop on container gardening for urban spaces. Learn soil selection, seed starting, pest control, and companion planting from a master gardener. Hands-on activities include potting herbs and vegetables, with take-home kits provided. Discuss balcony yields, seasonal rotations, and eco-benefits like pollination support. Ideal for apartment dwellers eager to harvest homegrown bounty.",
    "date": "2025-11-15T00:00:00",
    "time": "14:00",
    "location": "Downtown Community Center, Brampton",
    "category": "Workshop",
    "userID": "r8s9t0u1-v2w3-x4y5-z6a7-b8c9d0e1f2g3",
    "status": "Pending Approval",
    "price": 25.50,
    "createdAt": "2025-10-20T00:00:00",
    "updatedAt": "2025-11-10T00:00:00"
  },
  {
    "_id": "3c4d5e6f-7g8h-9i0j-1k2l-m3n4o5p6q7r8",
    "title": "Photography Walk",
    "description": "Capture the autumn hues and hidden gems of our local trails on this guided photography outing with a professional lens. Tips on composition, lighting, and editing apps will elevate your shots, from macro leaves to landscape panoramas. Group critiques and sharing circles follow the walk, with optional darkroom access for prints. Bring your camera or phone—focus on creativity, not gear, in this inspiring outdoor adventure.",
    "date": "2025-11-08T00:00:00",
    "time": "10:00",
    "location": "Local Park, Mississauga",
    "category": "Social",
    "userID": "s9t0u1v2-w3x4-y5z6-a7b8-c9d0e1f2g3h4",
    "status": "Published",
    "price": 15.00,
    "createdAt": "2025-10-05T00:00:00",
    "updatedAt": "2025-10-28T00:00:00"
  },
  {
    "_id": "4d5e6f7g-8h9i-0j1k-2l3m-n4o5p6q7r8s9",
    "title": "Language Exchange Meetup",
    "description": "Bridge cultures through conversation at this bilingual exchange pairing English speakers with French/Spanish learners for tandem practice. Structured rotations, role-play scenarios, and cultural trivia games keep it engaging. Native facilitators correct pronunciation and introduce idioms, while snacks from participating countries add flavor. Build confidence, make global friends, and discover nuances that apps can't teach in this vibrant linguistic salon.",
    "date": "2025-12-12T00:00:00",
    "time": "19:30",
    "location": "Tech Hub Toronto",
    "category": "Social",
    "userID": "t0u1v2w3-x4y5-z6a7-b8c9-d0e1f2g3h4i5",
    "status": "Rejected",
    "price": 0,
    "createdAt": "2025-10-25T00:00:00",
    "updatedAt": "2025-11-15T00:00:00"
  },
  {
    "_id": "5e6f7g8h-9i0j-1k2l-3m4n-o5p6q7r8s9t0",
    "title": "Volunteer Tree Planting",
    "description": "Contribute to reforestation by planting native saplings along riverbanks, guided by arborists on site selection and care techniques. Learn about tree benefits for air quality, wildlife habitats, and flood control through educational stations. Team challenges, progress tracking apps, and a post-plant BBQ celebrate efforts. Families welcome with kid-sized tools—leave a greener legacy with every shovel of soil.",
    "date": "2025-11-20T00:00:00",
    "time": "09:00",
    "location": "Charity Hall, Oakville",
    "category": "Volunteer",
    "userID": "u1v2w3x4-y5z6-a7b8-c9d0-e1f2g3h4i5j6",
    "status": "Published",
    "price": 0,
    "createdAt": "2025-10-10T00:00:00",
    "updatedAt": "2025-11-01T00:00:00"
  },
  {
    "_id": "6f7g8h9i-0j1k-2l3m-4n5o-p6q7r8s9t0u1",
    "title": "Coding for Kids Camp",
    "description": "Spark young minds with block-based coding adventures using Scratch to create animations, games, and stories. Age-appropriate challenges teach logic, loops, and debugging in a playful environment. Parent sessions on home extensions and career paths in STEM included. Certified instructors ensure fun learning, with showcase presentations at camp's end. Empower the next generation of creators one pixel at a time.",
    "date": "2025-12-15T00:00:00",
    "time": "10:00",
    "location": "Downtown Community Center, Brampton",
    "category": "Education",
    "userID": "v2w3x4y5-z6a7-b8c9-d0e1-f2g3h4i5j6k7",
    "status": "Pending Approval",
    "price": 80.00,
    "createdAt": "2025-10-18T00:00:00",
    "updatedAt": "2025-11-12T00:00:00"
  },
  {
    "_id": "7g8h9i0j-1k2l-3m4n-5o6p-q7r8s9t0u1v2",
    "title": "Fitness Bootcamp",
    "description": "Ignite your metabolism with high-intensity interval training circuits blending cardio, strength, and core work in an outdoor bootcamp. Led by NASM-certified trainers, sessions scale for all fitness levels, with modifications for injuries. Track progress via apps, hydrate stations, and cool-down yoga flows included. Community challenges and leaderboards foster motivation—sweat together, succeed together in this energizing fitness revolution.",
    "date": "2025-11-25T00:00:00",
    "time": "06:30",
    "location": "Local Park, Mississauga",
    "category": "Health",
    "userID": "w3x4y5z6-a7b8-c9d0-e1f2-g3h4i5j6k7l8",
    "status": "Published",
    "price": 20.00,
    "createdAt": "2025-10-08T00:00:00",
    "updatedAt": "2025-10-30T00:00:00"
  },
  {
    "_id": "8h9i0j1k-2l3m-4n5o-6p7q-r8s9t0u1v2w3",
    "title": "Storytelling Circle",
    "description": "Gather around the fire pit for an evening of oral traditions, where elders and storytellers share folktales, personal anecdotes, and moral fables from diverse heritages. Prompted themes like 'journeys home' guide shares, with interactive elements for audience co-creation. Instruments and soundscapes enhance immersion. This circle preserves narratives, heals through listening, and weaves a tapestry of human experience under the stars.",
    "date": "2025-12-18T00:00:00",
    "time": "20:00",
    "location": "Virtual via Zoom",
    "category": "Social",
    "userID": "x4y5z6a7-b8c9-d0e1-f2g3-h4i5j6k7l8m9",
    "status": "Rejected",
    "price": 0,
    "createdAt": "2025-10-22T00:00:00",
    "updatedAt": "2025-11-08T00:00:00"
  },
  {
    "_id": "9i0j1k2l-3m4n-5o6p-7q8r-s9t0u1v2w3x4",
    "title": "Sustainable Fashion Swap",
    "description": "Refresh your wardrobe responsibly by swapping gently used clothes, accessories, and shoes in a pop-up thrift event promoting circular fashion. Stylists offer mix-and-match advice, upcycling demos turn old tees into totes, and talks on ethical brands educate on slow fashion. Donation bins for unsold items support shelters. A chic, eco-conscious gathering to curate your closet with conscience and style.",
    "date": "2025-11-28T00:00:00",
    "time": "13:00",
    "location": "Tech Hub Toronto",
    "category": "Market",
    "userID": "y5z6a7b8-c9d0-e1f2-g3h4-i5j6k7l8m9n0",
    "status": "Published",
    "price": 5.00,
    "createdAt": "2025-10-12T00:00:00",
    "updatedAt": "2025-11-02T00:00:00"
  },
  {
    "_id": "0j1k2l3m-4n5o-6p7q-8r9s-t0u1v2w3x4y5",
    "title": "Mindfulness Meditation",
    "description": "Cultivate inner peace with a 90-minute guided meditation journey incorporating breathwork, body scans, and loving-kindness practices. Suitable for all experience levels, the session uses ambient sounds and progressive relaxation to quiet the mind. Debrief circle shares insights, with take-home audio guides for daily practice. Partnered with mental health experts, this oasis promotes stress reduction and emotional balance in a serene space.",
    "date": "2025-12-05T00:00:00",
    "time": "08:00",
    "location": "Charity Hall, Oakville",
    "category": "Health",
    "userID": "z6a7b8c9-d0e1-f2g3-h4i5-j6k7l8m9n0o1",
    "status": "Pending Approval",
    "price": 10.00,
    "createdAt": "2025-10-28T00:00:00",
    "updatedAt": "2025-11-20T00:00:00"
  },
  {
    "_id": "1k2l3m4n-5o6p-7q8r-9s0t-u1v2w3x4y5z6",
    "title": "DIY Home Decor Workshop",
    "description": "Unleash your interior designer with projects like macrame wall hangings, painted terrariums, and thrifted frame revamps using affordable materials. Step-by-step tutorials from craft pros, with color theory tips and space optimization advice. Gallery walk to admire creations, plus a swap table for supplies. Take your unique piece home and transform your living space on a budget with style and sustainability.",
    "date": "2025-11-30T00:00:00",
    "time": "15:00",
    "location": "Downtown Community Center, Brampton",
    "category": "Workshop",
    "userID": "a7b8c9d0-e1f2-g3h4-i5j6-k7l8m9n0o1p2",
    "status": "Published",
    "price": 30.00,
    "createdAt": "2025-10-16T00:00:00",
    "updatedAt": "2025-11-10T00:00:00"
  },
  {
    "_id": "2l3m4n5o-6p7q-8r9s-0t1u-v2w3x4y5z6a7",
    "title": "Pet Adoption Fair",
    "description": "Meet your furry soulmate at this heartwarming fair featuring shelter dogs, cats, and rabbits ready for forever homes. Vetted by vets, each animal has a profile highlighting personality and needs. Adoption counselors guide the process, with on-site spay/neuter info and supply giveaways. Fun zones include agility demos and photo booths—celebrate new beginnings with tail-wags and purrs in a loving atmosphere.",
    "date": "2025-12-08T00:00:00",
    "time": "11:00",
    "location": "Local Park, Mississauga",
    "category": "Charity",
    "userID": "b8c9d0e1-f2g3-h4i5-j6k7-l8m9n0o1p2q3",
    "status": "Rejected",
    "price": 0,
    "createdAt": "2025-10-21T00:00:00",
    "updatedAt": "2025-11-05T00:00:00"
  },
  {
    "_id": "3m4n5o6p-7q8r-9s0t-1u2v-w3x4y5z6a7b8",
    "title": "Dance Fitness Class",
    "description": "Groove your way to fitness with Zumba-inspired routines fusing Latin rhythms, hip-hop beats, and Bollywood flair for a calorie-torching cardio party. No partner needed—solo or group moves led by energetic instructors keep energy high. Warm-ups, cool-downs, and hydration breaks ensure safety. Progress tracking via group challenges—dance like nobody's watching, sweat like everybody's cheering in this joyful movement celebration.",
    "date": "2025-11-22T00:00:00",
    "time": "18:00",
    "location": "Tech Hub Toronto",
    "category": "Health",
    "userID": "c9d0e1f2-g3h4-i5j6-k7l8-m9n0o1p2q3r4",
    "status": "Published",
    "price": 12.00,
    "createdAt": "2025-10-14T00:00:00",
    "updatedAt": "2025-11-03T00:00:00"
  },
  {
    "_id": "4n5o6p7q-8r9s-0t1u-2v3w-x4y5z6a7b8c9",
    "title": "Wine Tasting Evening",
    "description": "Savor the nuances of regional wines from Niagara vineyards through guided tastings paired with charcuterie boards. Sommeliers demystify varietals, terroir, and food synergies, with note-taking sheets for personal cellars. Themed flights explore reds, whites, and sparklers, followed by casual mingling. Elevate your palate, discover favorites, and toast to refined evenings in this oenophile's delight.",
    "date": "2025-12-20T00:00:00",
    "time": "20:00",
    "location": "Virtual via Zoom",
    "category": "Social",
    "userID": "d0e1f2g3-h4i5-j6k7-l8m9-n0o1p2q3r4s5",
    "status": "Pending Approval",
    "price": 45.00,
    "createdAt": "2025-10-26T00:00:00",
    "updatedAt": "2025-11-18T00:00:00"
  },
  {
    "_id": "5o6p7q8r-9s0t-1u2v-3w4x-y5z6a7b8c9d0",
    "title": "Knitting Circle",
    "description": "Stitch stories and friendships in this cozy circle tackling scarves, hats, and charity blankets with beginner patterns and advanced cables. Expert knitters troubleshoot tension and techniques, with yarn swaps and pattern libraries. Themed projects like 'cozy critters' for kids add whimsy. Relax with tea, share progress pics, and contribute to community warmth one loop at a time.",
    "date": "2025-11-27T00:00:00",
    "time": "17:00",
    "location": "Charity Hall, Oakville",
    "category": "Workshop",
    "userID": "e1f2g3h4-i5j6-k7l8-m9n0-o1p2q3r4s5t6",
    "status": "Published",
    "price": 0,
    "createdAt": "2025-10-11T00:00:00",
    "updatedAt": "2025-10-29T00:00:00"
  },
  {
    "_id": "6p7q8r9s-0t1u-2v3w-4x5y-z6a7b8c9d0e1",
    "title": "Birdwatching Excursion",
    "description": "Spot migratory warblers and resident cardinals on a guided dawn hike through wetland trails, armed with binoculars and field guides from ornithologists. Log sightings in eBird apps, learn calls and behaviors, and discuss conservation threats like habitat loss. Picnic breakfast with bird-themed trivia caps the outing. A feathered feast for eyes and souls, connecting us to nature's symphony.",
    "date": "2025-12-14T00:00:00",
    "time": "06:00",
    "location": "Local Park, Mississauga",
    "category": "Social",
    "userID": "f2g3h4i5-j6k7-l8m9-n0o1-p2q3r4s5t6u7",
    "status": "Rejected",
    "price": 18.00,
    "createdAt": "2025-10-19T00:00:00",
    "updatedAt": "2025-11-06T00:00:00"
  },
  {
    "_id": "7q8r9s0t-1u2v-3w4x-5y6z-a7b8c9d0e1f2",
    "title": "Budgeting Workshop",
    "description": "Take control of your finances with practical strategies on envelope systems, 50/30/20 rules, and app tracking for expenses. Financial planners demo debt snowball methods and emergency fund builds, with worksheets for goal setting. Q&A tackles real scenarios like vacation savings or student loans. Empower yourself with knowledge to achieve financial freedom and peace of mind.",
    "date": "2025-11-19T00:00:00",
    "time": "19:00",
    "location": "Downtown Community Center, Brampton",
    "category": "Financial",
    "userID": "g3h4i5j6-k7l8-m9n0-o1p2-q3r4s5t6u7v8",
    "status": "Published",
    "price": 0,
    "createdAt": "2025-10-07T00:00:00",
    "updatedAt": "2025-10-25T00:00:00"
  },
  {
    "_id": "8r9s0t1u-2v3w-4x5y-6z7a-b8c9d0e1f2g3",
    "title": "Improv Comedy Night",
    "description": "Laugh out loud at spontaneous sketches, audience-suggested scenes, and character improv from a troupe of quick-witted performers. Workshops for volunteers teach 'yes, and' principles and freeze tags. Themed shows like 'superhero mishaps' keep it fresh. A hilarious tonic for the soul, building confidence through play and reminding us life's best moments are unscripted.",
    "date": "2025-12-11T00:00:00",
    "time": "20:30",
    "location": "Tech Hub Toronto",
    "category": "Social",
    "userID": "h4i5j6k7-l8m9-n0o1-p2q3-r4s5t6u7v8w9",
    "status": "Pending Approval",
    "price": 22.00,
    "createdAt": "2025-10-24T00:00:00",
    "updatedAt": "2025-11-09T00:00:00"
  },
  {
    "_id": "9s0t1u2v-3w4x-5y6z-7a8b-c9d0e1f2g3h4",
    "title": "Herbal Tea Blending",
    "description": "Craft custom herbal infusions with foraged and organic botanicals, learning about chamomile's calm, ginger's warmth, and lavender's soothe. Blending stations guide flavor profiles for immunity, sleep, and digestion, with tasting flights and label-making. Herbalist talks on sustainable sourcing and steeping times. Bottle your blends to sip serenity from nature's apothecary.",
    "date": "2025-11-16T00:00:00",
    "time": "16:00",
    "location": "Virtual via Zoom",
    "category": "Workshop",
    "userID": "i5j6k7l8-m9n0-o1p2-q3r4-s5t6u7v8w9x0",
    "status": "Published",
    "price": 35.00,
    "createdAt": "2025-10-13T00:00:00",
    "updatedAt": "2025-11-04T00:00:00"
  },
  {
    "_id": "0t1u2v3w-4x5y-6z7a-8b9c-d0e1f2g3h4i5",
    "title": "Stargazing Party",
    "description": "Gaze at constellations and planets through telescopes under dark skies, guided by astronomers mapping Orion's belt and Venus's glow. Apps for star identification, mythology tales, and meteor shower alerts enhance the wonder. Blankets, hot drinks, and quiet reflection spots provided. A celestial escape connecting us to the cosmos's vast, humbling beauty.",
    "date": "2025-12-07T00:00:00",
    "time": "21:00",
    "location": "Local Park, Mississauga",
    "category": "Social",
    "userID": "j6k7l8m9-n0o1-p2q3-r4s5-t6u7v8w9x0y1",
    "status": "Rejected",
    "price": 0,
    "createdAt": "2025-10-17T00:00:00",
    "updatedAt": "2025-11-07T00:00:00"
  },
  {
    "_id": "1u2v3w4x-5y6z-7a8b-9c0d-e1f2g3h4i5j6",
    "title": "Public Speaking Toastmasters",
    "description": "Hone your oratory prowess in a supportive club with prepared speeches, impromptu table topics, and constructive evaluations. Themes rotate from persuasive talks to storytelling, with humor and icebreakers to ease nerves. Leadership roles like timer and grammarian build skills. Transform stage fright into confident communication, one toast at a time.",
    "date": "2025-11-21T00:00:00",
    "time": "19:15",
    "location": "Downtown Community Center, Brampton",
    "category": "Education",
    "userID": "k7l8m9n0-o1p2-q3r4-s5t6-u7v8w9x0y1z2",
    "status": "Published",
    "price": 0,
    "createdAt": "2025-10-09T00:00:00",
    "updatedAt": "2025-10-31T00:00:00"
  },
  {
    "_id": "2v3w4x5y-6z7a-8b9c-0d1e-f2g3h4i5j6k7",
    "title": "Vegan Cooking Demo",
    "description": "Whip up plant-powered masterpieces like jackfruit carnitas tacos and cashew cheese boards in this demo-turned-hands-on class. Nutritionists explain protein myths and flavor boosters, with grocery lists and substitutions for allergies. Tasting rounds and plating contests add fun. Nourish body and planet with delicious, cruelty-free cuisine that's easy to replicate at home.",
    "date": "2025-12-13T00:00:00",
    "time": "17:30",
    "location": "Tech Hub Toronto",
    "category": "Workshop",
    "userID": "l8m9n0o1-p2q3-r4s5-t6u7-v8w9x0y1z2a3",
    "status": "Pending Approval",
    "price": 28.00,
    "createdAt": "2025-10-23T00:00:00",
    "updatedAt": "2025-11-11T00:00:00"
  }
]